In [1]:
import pandas as pd
import numpy as np

In [2]:
fc= pd.read_csv("Fraud_check.csv")

In [3]:
fc.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [4]:
fc.shape

(600, 6)

In [5]:
fc.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [6]:
fc.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [7]:
fc.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [8]:
# Defining The data frame
df=pd.DataFrame(fc)

In [9]:
# create dummies for Marital.Status
dummies = pd.get_dummies(df['Marital.Status']).rename(columns=lambda x: 'Marital.Status_' + str(x))
# bring the dummies back into the original dataset
df = pd.concat([df, dummies], axis=1)
print(df)

    Undergrad Marital.Status  Taxable.Income  City.Population  \
0          NO         Single           68833            50047
1         YES       Divorced           33700           134075
2          NO        Married           36925           160205
3         YES         Single           50190           193264
4          NO        Married           81002            27533
..        ...            ...             ...              ...
595       YES       Divorced           76340            39492
596       YES       Divorced           69967            55369
597        NO       Divorced           47334           154058
598       YES        Married           98592           180083
599        NO       Divorced           96519           158137

     Work.Experience Urban  Marital.Status_Divorced  Marital.Status_Married  \
0                 10   YES                        0                       0
1                 18   YES                        1                       0
2                 30   YES                        0                       1
3                 15   YES                        0                       0
4                 28    NO                        0                       1
..               ...   ...                      ...                     ...
595                7   YES                        1                       0
596                2   YES                        1                       0
597                0   YES                        1                       0
598               17    NO                        0                       1
599               16    NO                        1                       0

     Marital.Status_Single
0                        1
1                        0
2                        0
3                        1
4                        0
..                     ...
595                      0
596                      0
597                      0
598                      0
599                      0

[600 rows x 9 columns]

In [10]:
# create dummies for Urban
dummies = pd.get_dummies(df['Urban']).rename(columns=lambda x: 'Urban_' + str(x))
# bring the dummies back into the original dataset
df = pd.concat([df, dummies], axis=1)
print(df)

    Undergrad Marital.Status  Taxable.Income  City.Population  \
0          NO         Single           68833            50047
1         YES       Divorced           33700           134075
2          NO        Married           36925           160205
3         YES         Single           50190           193264
4          NO        Married           81002            27533
..        ...            ...             ...              ...
595       YES       Divorced           76340            39492
596       YES       Divorced           69967            55369
597        NO       Divorced           47334           154058
598       YES        Married           98592           180083
599        NO       Divorced           96519           158137

     Work.Experience Urban  Marital.Status_Divorced  Marital.Status_Married  \
0                 10   YES                        0                       0
1                 18   YES                        1                       0
2                 30   YES                        0                       1
3                 15   YES                        0                       0
4                 28    NO                        0                       1
..               ...   ...                      ...                     ...
595                7   YES                        1                       0
596                2   YES                        1                       0
597                0   YES                        1                       0
598               17    NO                        0                       1
599               16    NO                        1                       0

     Marital.Status_Single  Urban_NO  Urban_YES
0                        1         0          1
1                        0         0          1
2                        0         0          1
3                        1         0          1
4                        0         1          0
..                     ...       ...        ...
595                      0         0          1
596                      0         0          1
597                      0         0          1
598                      0         1          0
599                      0         1          0

[600 rows x 11 columns]

In [11]:
# create dummies for Undergrad
dummies = pd.get_dummies(df['Undergrad']).rename(columns=lambda x: 'Undergrad_' + str(x))
# bring the dummies back into the original dataset
df = pd.concat([df, dummies], axis=1)
print(df)

    Undergrad Marital.Status  Taxable.Income  City.Population  \
0          NO         Single           68833            50047
1         YES       Divorced           33700           134075
2          NO        Married           36925           160205
3         YES         Single           50190           193264
4          NO        Married           81002            27533
..        ...            ...             ...              ...
595       YES       Divorced           76340            39492
596       YES       Divorced           69967            55369
597        NO       Divorced           47334           154058
598       YES        Married           98592           180083
599        NO       Divorced           96519           158137

     Work.Experience Urban  Marital.Status_Divorced  Marital.Status_Married  \
0                 10   YES                        0                       0
1                 18   YES                        1                       0
2                 30   YES                        0                       1
3                 15   YES                        0                       0
4                 28    NO                        0                       1
..               ...   ...                      ...                     ...
595                7   YES                        1                       0
596                2   YES                        1                       0
597                0   YES                        1                       0
598               17    NO                        0                       1
599               16    NO                        1                       0

     Marital.Status_Single  Urban_NO  Urban_YES  Undergrad_NO  Undergrad_YES
0                        1         0          1             1              0
1                        0         0          1             0              1
2                        0         0          1             1              0
3                        1         0          1             0              1
4                        0         1          0             1              0
..                     ...       ...        ...           ...            ...
595                      0         0          1             0              1
596                      0         0          1             0              1
597                      0         0          1             1              0
598                      0         1          0             0              1
599                      0         1          0             1              0

[600 rows x 13 columns]

In [12]:
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Urban_NO,Urban_YES,Undergrad_NO,Undergrad_YES
0,NO,Single,68833,50047,10,YES,0,0,1,0,1,1,0
1,YES,Divorced,33700,134075,18,YES,1,0,0,0,1,0,1
2,NO,Married,36925,160205,30,YES,0,1,0,0,1,1,0
3,YES,Single,50190,193264,15,YES,0,0,1,0,1,0,1
4,NO,Married,81002,27533,28,NO,0,1,0,1,0,1,0

In [13]:
df = df.drop(['Marital.Status','Undergrad','Urban'], axis = 1)

In [14]:
df.head()

,Taxable.Income,City.Population,Work.Experience,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Urban_NO,Urban_YES,Undergrad_NO,Undergrad_YES
0,68833,50047,10,0,0,1,0,1,1,0
1,33700,134075,18,1,0,0,0,1,0,1
2,36925,160205,30,0,1,0,0,1,1,0
3,50190,193264,15,0,0,1,0,1,0,1
4,81002,27533,28,0,1,0,1,0,1,0

In [15]:
row_indexes=df[df['Taxable.Income']>=30000].index
df.loc[row_indexes,'tax']="Good"

In [17]:
row_indexes=df[df['Taxable.Income']<30000].index
df.loc[row_indexes,'tax']="Risky"

In [18]:
df.head()

,Taxable.Income,City.Population,Work.Experience,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Urban_NO,Urban_YES,Undergrad_NO,Undergrad_YES,tax
0,68833,50047,10,0,0,1,0,1,1,0,Good
1,33700,134075,18,1,0,0,0,1,0,1,Good
2,36925,160205,30,0,1,0,0,1,1,0,Good
3,50190,193264,15,0,0,1,0,1,0,1,Good
4,81002,27533,28,0,1,0,1,0,1,0,Good

In [19]:
df = df.drop('Taxable.Income', 1)
df.head()

,City.Population,Work.Experience,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Urban_NO,Urban_YES,Undergrad_NO,Undergrad_YES,tax
0,50047,10,0,0,1,0,1,1,0,Good
1,134075,18,1,0,0,0,1,0,1,Good
2,160205,30,0,1,0,0,1,1,0,Good
3,193264,15,0,0,1,0,1,0,1,Good
4,27533,28,0,1,0,1,0,1,0,Good

In [20]:
colnames = list(df.columns)
colnames

['City.Population',
 'Work.Experience',
 'Marital.Status_Divorced',
 'Marital.Status_Married',
 'Marital.Status_Single',
 'Urban_NO',
 'Urban_YES',
 'Undergrad_NO',
 'Undergrad_YES',
 'tax']

In [21]:
predictors = colnames[:9]
target = colnames[9]

In [22]:
predictors

['City.Population',
 'Work.Experience',
 'Marital.Status_Divorced',
 'Marital.Status_Married',
 'Marital.Status_Single',
 'Urban_NO',
 'Urban_YES',
 'Undergrad_NO',
 'Undergrad_YES']

In [23]:
target

'tax'

In [24]:
X = df[predictors]
Y = df[target]
X

,City.Population,Work.Experience,Marital.Status_Divorced,Marital.Status_Married,Marital.Status_Single,Urban_NO,Urban_YES,Undergrad_NO,Undergrad_YES
0,50047,10,0,0,1,0,1,1,0
1,134075,18,1,0,0,0,1,0,1
2,160205,30,0,1,0,0,1,1,0
3,193264,15,0,0,1,0,1,0,1
4,27533,28,0,1,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...
595,39492,7,1,0,0,0,1,0,1
596,55369,2,1,0,0,0,1,0,1
597,154058,0,1,0,0,0,1,1,0
598,180083,17,0,1,0,1,0,0,1
599,158137,16,1,0,0,1,0,1,0

In [25]:
Y

0      Good
1      Good
2      Good
3      Good
4      Good
       ...
595    Good
596    Good
597    Good
598    Good
599    Good
Name: tax, Length: 600, dtype: object

In [26]:
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(n_jobs=2,oob_score=True,n_estimators=15,criterion="entropy")

In [27]:
rf.fit(X,Y) # Fitting RandomForestClassifier model from sklearn.ensemble 
rf.estimators_

[DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1755503286),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=55399328),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1255858685),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=552186583),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=219525681),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=2129952650),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=239975496),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1975305687),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1275696826),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=2015308778),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1594084072),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=232771718),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1230830998),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1902937594),
 DecisionTreeClassifier(criterion='entropy', max_features='auto',
                        random_state=1260971997)]

In [28]:
rf.classes_ # class labels (output)
rf.n_classes_ # Number of levels in class labels

2

In [29]:
rf.n_features_  # Number of input features in model 9  here.

9

In [30]:
rf.n_outputs_ # Number of outputs when fit performed

1

In [31]:
rf.oob_score_  # 0.71333

0.715

In [32]:
rf.predict(X)

array(['Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Risky',
       'Good', 'Risky', 'Good', 'Good', 'Good', 'Risky', 'Risky', 'Good',
       'Risky', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Risky', 'Risky', 'Risky', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky',
       'Good', 'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Risky', 'Risky', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Risky', 'Risky', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Risky', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good',
       'Risky', 'Risky', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Risky', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Risky',
       'Good', 'Risky', 'Good', 'Risky', 'Good', 'Risky', 'Good', 'Good',
       'Good', 'Risky', 'Risky', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Good', 'Good', 'Risky', 'Good', 'Good',
       'Risky', 'Good', 'Risky', 'Good', 'Risky', 'Risky', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Risky', 'Good', 'Good', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Good', 'Risky', 'Risky', 'Good', 'Good', 'Risky', 'Risky',
       'Risky', 'Good', 'Good', 'Good', 'Risky', 'Risky', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Risky', 'Risky', 'Risky', 'Good', 'Good', 'Risky',
       'Good', 'Good', 'Risky', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Risky', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good', 'Risky',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Risky', 'Good',
       'Good', 'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Risky', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Risky', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good',
       'Good'], dtype=object)

In [33]:
df['rf_pred'] = rf.predict(X)

In [34]:
cols = ['rf_pred','tax']
cols

['rf_pred', 'tax']

In [35]:
['rf_pred', 'sales']

['rf_pred', 'sales']

In [36]:
from sklearn.metrics import confusion_matrix
confusion_matrix(df['tax'],df['rf_pred'])

array([[476,   0],
       [ 10, 114]], dtype=int64)